let questions = [
    {
        numb: 1,
        question: 'Что такое ГРАФ?',
        answer: 'Один из способов графического представления информации',
        options: [
            'Чертеж-карта с масштабом 1 к 1',
            'Один из способов графического представления информации',
            'Каракули',
            '"Паутина", связывающая персональные компьютеры'

        ]
    },
    {
        numb: 2,
        question: 'Граф состоит из:',
        answer: 'вершин, дуг и рёбер',
        options: [
            'вершин, дуг и рёбер',
            'узлов и ветвей',
            'рёбер и дуг',
            'рёбер и вершин'

        ]
    },
    {
        numb: 3,
        question: 'Вершина называется изолированной, если она',
        answer: 'не является концом ни одного ребра',
        options: [
            'является концом только одного ребра',
            'является концом 2-х или 3-х рёбер',
            'не является концом вообще',
            'не является концом ни одного ребра'
        ]
    },
    {
        numb: 4,
        question: 'Какого способа представления графа не существует?',
        answer: 'Матрица идентичности',
        options: [
            'Графический способ',
            'Матрица идентичности',
            'Список рёбер',
            'Матрица смежности'
        ]
    },
    {
        numb: 5,
        question: 'Какой граф называют простым?',
        answer: 'У которого вершины не повторяются',
        options: [
            'У которого первая и последняя вершина совпадают',
            'У котрого не повторяются рёбра',
            'У которого вершины не повторяются',
            'У которого повторяются одна или несколько вершин'
        ]
    },
];
